# Applying functions to DataFrames or Series

In [46]:
import numpy as np
import pandas as pd

In [47]:
df = pd.DataFrame( {'user' : [1,2,3], 'age' : [24,54,17],  'gender' : ['F','F','M'], 'occupation' : ['technician','musician','student']})
df

   user  age gender  occupation
0     1   24      F  technician
1     2   54      F    musician
2     3   17      M     student

## The map() method

In [48]:
df['gender'] = df.gender.map({'F':'Female', 'M':'Male'})
df

   user  age  gender  occupation
0     1   24  Female  technician
1     2   54  Female    musician
2     3   17    Male     student

## The apply() method

In [49]:
def dog_years(x):
    return x // 7

In [50]:
df['age_dog_years'] = df['age'].apply(dog_years)
df

   user  age  gender  occupation  age_dog_years
0     1   24  Female  technician              3
1     2   54  Female    musician              7
2     3   17    Male     student              2

### Example of apply() along either axis

In [52]:
df2 = pd.DataFrame(np.arange(9).reshape(3,3), columns=['a','b', 'c'])
df2

   a  b  c
0  0  1  2
1  3  4  5
2  6  7  8

In [51]:
def my_sum(x):
    return sum(x)

In [53]:
df2.apply(my_sum, axis=0)

a     9
b    12
c    15
dtype: int64

In [54]:
df2.apply(my_sum, axis=1)

0     3
1    12
2    21
dtype: int64

## The applymap() method

#### The applymap() method is used to apply a function to every element of a DataFrame. Let's demonstrate an example using our DataFrame

In [55]:
def add_two(x):
    return x+2

In [56]:
df2.applymap(add_two)

   a  b   c
0  2  3   4
1  5  6   7
2  8  9  10